LC3WithExtensionFilled/0/blueprints/wall_slip/omega
    {
        type            zeroGradient;
    }
    
