LC3WithExtensionFilled/system/mapFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patchMap        ( );

cuttingPatches  ( );

// ************************************************************************* //
